# Pandas

In [1]:
import pandas as pd
import numpy as np

### Series

In [2]:
data = pd.Series([5,10,15,20])
data

0     5
1    10
2    15
3    20
dtype: int64

In [3]:
data.values

array([ 5, 10, 15, 20], dtype=int64)

In [4]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
data = pd.Series([10,20,30,40], index=['a','b','c','d'])
data

a    10
b    20
c    30
d    40
dtype: int64

In [6]:
data.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [7]:
data.index=[2,3,5,6]

In [8]:
data.index

Int64Index([2, 3, 5, 6], dtype='int64')

In [9]:
data

2    10
3    20
5    30
6    40
dtype: int64

In [10]:
dict = {'a':1,
        'b':2,
        'c':3,
        'd':4}
pd.Series(dict)

a    1
b    2
c    3
d    4
dtype: int64

In [11]:
pd.Series(1, index=['a','b','c'])

a    1
b    1
c    1
dtype: int64

### DataFrame

In [12]:
d = pd.DataFrame({'A':[1,2,3], 'B':[4,5,6], 'C':[7,8,9]}, index=['i','ii','iii'])

In [13]:
d['A']

i      1
ii     2
iii    3
Name: A, dtype: int64

In [14]:
d.shape, d.ndim

((3, 3), 2)

### Index

In [15]:
ind = pd.Index([1,2,3,4])
ind

Int64Index([1, 2, 3, 4], dtype='int64')

In [16]:
ind.size, ind.ndim, ind.shape

(4, 1, (4,))

In [17]:
a = pd.Index([1,2,3,4])
b = pd.Index([2,3,4,5])

In [18]:
print("Union ",a|b)
print("Intersection ", a&b)
print("Symmetric diff ", a^b)

Union  Int64Index([1, 2, 3, 4, 5], dtype='int64')
Intersection  Int64Index([2, 3, 4], dtype='int64')
Symmetric diff  Int64Index([1, 5], dtype='int64')

C:\Users\ADMIN\AppData\Local\Temp/ipykernel_5196/3831873656.py:1: FutureWarning: Index.__or__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__or__.  Use index.union(other) instead
  print("Union ",a|b)
C:\Users\ADMIN\AppData\Local\Temp/ipykernel_5196/3831873656.py:2: FutureWarning: Index.__and__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__and__.  Use index.intersection(other) instead
  print("Intersection ", a&b)
C:\Users\ADMIN\AppData\Local\Temp/ipykernel_5196/3831873656.py:3: FutureWarning: Index.__xor__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__xor__.  Use index.symmetric_difference(other) instead
  print("Symmetric diff ", a^b)

### Selection in Series

In [19]:
data = pd.Series([0.25, 0.5, 0.75, 1.0], index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [20]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [21]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [22]:
data.item

<bound method IndexOpsMixin.item of a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64>

In [23]:
data['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [24]:
data[0:2]

a    0.25
b    0.50
dtype: float64

### Selection in DataFrame

In [25]:
d

     A  B  C
i    1  4  7
ii   2  5  8
iii  3  6  9

In [26]:
d['A']

i      1
ii     2
iii    3
Name: A, dtype: int64

In [27]:
d['AB'] = d['A'] * d['B']
d

     A  B  C  AB
i    1  4  7   4
ii   2  5  8  10
iii  3  6  9  18

In [28]:
d.keys()

Index(['A', 'B', 'C', 'AB'], dtype='object')

In [29]:
d.values

array([[ 1,  4,  7,  4],
       [ 2,  5,  8, 10],
       [ 3,  6,  9, 18]], dtype=int64)

In [30]:
d.values[1]

array([ 2,  5,  8, 10], dtype=int64)

In [31]:
d.iloc[:1, :3]

   A  B  C
i  1  4  7

In [32]:
d.loc[:'ii', :'C']

    A  B  C
i   1  4  7
ii  2  5  8

In [33]:
d['i':'ii']

    A  B  C  AB
i   1  4  7   4
ii  2  5  8  10

### Ufuncs (Universal Functions)

| Python operator | Pandas method(s) |
|--|--|
| + | add() |
| - | sub(), subtract() |
| * | mul(), multiply() |
| / | truediv(), div(), divide() |
| // | floordiv() |
| % | mod() |
| ** | pow() |

### Handling Missing Data

* isnull() - Generate a Boolean mask indicating missing values
* notnull() - Opposite of isnull()
* dropna() - Return a filtered version of the data
* fillna() - Return a copy of the data with missing values filled or imputed

In [34]:
data = pd.Series([1,2,np.nan, 4, None])
data

0    1.0
1    2.0
2    NaN
3    4.0
4    NaN
dtype: float64

In [35]:
data.isnull()

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [36]:
data.isna().any()

True

In [37]:
data.isnull().sum()

2

In [38]:
data.dropna()

0    1.0
1    2.0
3    4.0
dtype: float64

In [39]:
df = pd.DataFrame([[1, np.nan, 2], [2, 3, 5], [np.nan, 4, 6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [40]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [41]:
df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [42]:
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [43]:
df.fillna(0)

     0    1  2
0  1.0  0.0  2
1  2.0  3.0  5
2  0.0  4.0  6

In [44]:
df.fillna(method='ffill') 
#Forward Fill

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  2.0  4.0  6

In [45]:
df.fillna(method='bfill')
# Backward Fill

     0    1  2
0  1.0  3.0  2
1  2.0  3.0  5
2  NaN  4.0  6

### Hierachical (Multi index) indexing

In [46]:
ind = [('a', 1), ('a', 2), ('b', 1), ('b', 2), ('c', 1), ('c', 2)]
data = [10,20,30,40,50,60]

In [47]:
df = pd.Series(data, index=ind)
df

(a, 1)    10
(a, 2)    20
(b, 1)    30
(b, 2)    40
(c, 1)    50
(c, 2)    60
dtype: int64

In [48]:
ind = pd.MultiIndex.from_tuples(ind)
df = df.reindex(ind)
df

a  1    10
   2    20
b  1    30
   2    40
c  1    50
   2    60
dtype: int64

In [49]:
df[:, 2]

a    20
b    40
c    60
dtype: int64

In [50]:
df[:, 1]

a    10
b    30
c    50
dtype: int64

In [51]:
df.unstack()

    1   2
a  10  20
b  30  40
c  50  60

In [52]:
df = pd.DataFrame(np.random.randint(20, size=(6,3)), index=[['a','a','b','b','c','c'], [1,2,1,2,1,2]], columns=['d1', 'd2','d3'])
df

     d1  d2  d3
a 1   0   5  17
  2  19   5   5
b 1  10  15  11
  2  10   1  19
c 1  13  17  19
  2  15   6  12

In [53]:
df

     d1  d2  d3
a 1   0   5  17
  2  19   5   5
b 1  10  15  11
  2  10   1  19
c 1  13  17  19
  2  15   6  12

In [54]:
d

     A  B  C  AB
i    1  4  7   4
ii   2  5  8  10
iii  3  6  9  18

In [55]:
data = pd.Series(data)

In [56]:
data

0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64

In [57]:
pd.concat([d, data], keys=['d','data'])

             0    A    AB    B    C
d    i     NaN  1.0   4.0  4.0  7.0
     ii    NaN  2.0  10.0  5.0  8.0
     iii   NaN  3.0  18.0  6.0  9.0
data 0    10.0  NaN   NaN  NaN  NaN
     1    20.0  NaN   NaN  NaN  NaN
     2    30.0  NaN   NaN  NaN  NaN
     3    40.0  NaN   NaN  NaN  NaN
     4    50.0  NaN   NaN  NaN  NaN
     5    60.0  NaN   NaN  NaN  NaN

In [58]:
a = pd.DataFrame({'A':[1,2,3], 'B':[4,5,6], 'C':[7,8,9]})
b = pd.DataFrame({'d':[11,12,13], 'e':[14,15,16], 'f':[17,18,19]})
a

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [59]:
b

    d   e   f
0  11  14  17
1  12  15  18
2  13  16  19

In [60]:
pd.concat([a,b], axis=1, keys=['a','b'])

   a         b
   A  B  C   d   e   f
0  1  4  7  11  14  17
1  2  5  8  12  15  18
2  3  6  9  13  16  19

In [61]:
pd.concat([a,b], join='outer')

     A    B    C     d     e     f
0  1.0  4.0  7.0   NaN   NaN   NaN
1  2.0  5.0  8.0   NaN   NaN   NaN
2  3.0  6.0  9.0   NaN   NaN   NaN
0  NaN  NaN  NaN  11.0  14.0  17.0
1  NaN  NaN  NaN  12.0  15.0  18.0
2  NaN  NaN  NaN  13.0  16.0  19.0

In [62]:
a.append(b)

     A    B    C     d     e     f
0  1.0  4.0  7.0   NaN   NaN   NaN
1  2.0  5.0  8.0   NaN   NaN   NaN
2  3.0  6.0  9.0   NaN   NaN   NaN
0  NaN  NaN  NaN  11.0  14.0  17.0
1  NaN  NaN  NaN  12.0  15.0  18.0
2  NaN  NaN  NaN  13.0  16.0  19.0

### Combining Dataset (Merge and Join)

In [63]:
a = pd.DataFrame({'Letter':['A', 'B', 'C', 'D'], 'Digit':[1,2,3,4]})
a

  Letter  Digit
0      A      1
1      B      2
2      C      3
3      D      4

In [64]:
b = pd.DataFrame({'Letter':['A', 'B', 'C'], 'Roman':['i','ii','iii']})
b

  Letter Roman
0      A     i
1      B    ii
2      C   iii

In [65]:
pd.merge(a,b)

  Letter  Digit Roman
0      A      1     i
1      B      2    ii
2      C      3   iii

In [66]:
a = a.append({'Letter':'B', 'Digit':5}, ignore_index=True)
a, b

(  Letter  Digit
 0      A      1
 1      B      2
 2      C      3
 3      D      4
 4      B      5,
   Letter Roman
 0      A     i
 1      B    ii
 2      C   iii)

In [67]:
# Many to One join

pd.merge(a,b)

  Letter  Digit Roman
0      A      1     i
1      B      2    ii
2      B      5    ii
3      C      3   iii

In [68]:
b = b.append({'Letter':'B', 'Roman':'iv'}, ignore_index=True)
a, b

(  Letter  Digit
 0      A      1
 1      B      2
 2      C      3
 3      D      4
 4      B      5,
   Letter Roman
 0      A     i
 1      B    ii
 2      C   iii
 3      B    iv)

In [69]:
# Many to Many join

pd.merge(a,b)

  Letter  Digit Roman
0      A      1     i
1      B      2    ii
2      B      2    iv
3      B      5    ii
4      B      5    iv
5      C      3   iii

In [70]:
pd.merge(a, b, on='Letter')

  Letter  Digit Roman
0      A      1     i
1      B      2    ii
2      B      2    iv
3      B      5    ii
4      B      5    iv
5      C      3   iii

In [ ]:
a

  Letter  Digit
0      A      1
1      B      2
2      C      3
3      D      4

In [ ]:
c = pd.DataFrame({'Alpha':['A', 'B', 'C', 'D'], 'Roman':['i','ii','iii', 'iv']})
c

  Alpha Roman
0     A     i
1     B    ii
2     C   iii
3     D    iv

In [ ]:
# left_on and right_on

pd.merge(a,c, left_on='Letter', right_on='Alpha')

  Letter  Digit Alpha Roman
0      A      1     A     i
1      B      2     B    ii
2      C      3     C   iii
3      D      4     D    iv

In [ ]:
pd.merge(a,c,left_on='Letter', right_on='Alpha').drop('Alpha', axis=1)

  Letter  Digit Roman
0      A      1     i
1      B      2    ii
2      C      3   iii
3      D      4    iv

In [ ]:
a = a.set_index('Letter')
c = c.set_index('Alpha')

In [ ]:
pd.merge(a,c,left_index=True, right_index=True)

        Digit Roman
Letter
A           1     i
B           2    ii
C           3   iii
D           4    iv

In [ ]:
# a = a.drop([2,3])
a = a.reset_index()

In [ ]:
a = a.drop([2,3])
a

  Letter  Digit
0      A      1
1      B      2

In [ ]:
c = c.reset_index()

In [ ]:
pd.merge(a,c,left_on='Letter',right_on='Alpha',how='inner')

  Letter  Digit Alpha Roman
0      A      1     A     i
1      B      2     B    ii

In [ ]:
pd.merge(a,c,left_on='Letter',right_on='Alpha',how='outer')

  Letter  Digit Alpha Roman
0      A    1.0     A     i
1      B    2.0     B    ii
2    NaN    NaN     C   iii
3    NaN    NaN     D    iv

In [ ]:
pd.merge(a,c,left_on='Letter',right_on='Alpha',how='left')

  Letter  Digit Alpha Roman
0      A      1     A     i
1      B      2     B    ii

In [ ]:
pd.merge(a,c,left_on='Letter',right_on='Alpha',how='right')

  Letter  Digit Alpha Roman
0      A    1.0     A     i
1      B    2.0     B    ii
2    NaN    NaN     C   iii
3    NaN    NaN     D    iv

In [ ]:
c.columns.values[0] = 'Letter'

In [ ]:
a,c

(  Letter  Digit
 0      A      1
 1      B      2,
   Letter Roman
 0      A     i
 1      B    ii
 2      C   iii
 3      D    iv)

### Aggregation Methods

| Aggregation | Description |
|-|-|
| count() | Total number of items |
| first(), last() | First and last item |
| mean(), median() | Mean and median |
| min(), max() | Minimum and maximum |
| std(), var() | Standard deviation and variance |
| mad() | Mean absolute deviation |
| prod() | Product of all items |
| sum() | Sum of all items |

### String Method

|Method||||
|-|-|-|-|
| len() | lower() | translate() | islower() |
| ljust() | upper() | startswith() | isupper() |
| rjust() | find() | endswith() | isnumeric() |
| center() | rfind() | isalnum() | isdecimal() |
| zfill() | index() | isalpha() | split() | 
| strip() | rindex() | isdigit() | rsplit() |
| rstrip() | capitalize() | isspace() | partition() |
| lstrip() | swapcase() | istitle() | rpartition() |

| Method | Description 
|-|-|
| match() | Call re.match() on each element, returning a Boolean. 
| extract() | Call re.match() on each element, returning matched groups as strings.
| findall() | Call re.findall() on each element.
| replace() | Replace occurrences of pattern with some other string.
| contains() | Call re.search() on each element, returning a Boolean.
| count() | Count occurrences of pattern.
| split() | Equivalent to str.split(), but accepts regexps.
| rsplit() | Equivalent to str.rsplit(), but accepts regexps.

| Method | Description |
|-|-|
| get() | Index each element
| slice() | Slice each element
| slice_replace() | Replace slice in each element with passed value
| cat() | Concatenate strings
| repeat() | Repeat values
| normalize() | Return Unicode form of string
| pad() | Add whitespace to left, right, or both sides of strings
| wrap() | Split long strings into lines with length less than a given width
| join() | Join strings in each element of the Series with passed separator
| get_dummies() | Extract dummy variables as a DataFrame